FV2304/E_0103.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">MaBiS</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">7.9.1: AD: Beendigung der Zuordnung einer Netzgangzeitreihe zu einer Netzzeitreihe beim NB</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7a8da1", label=<<B>E_0103</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>1: </B>Entspricht die Beendigung der Zuordnung der Netzgangzeitreihe zur Netzzeitreihe<BR align="left"/>der Vereinbarung zur messtechnischen Abgrenzung der beiden benachbarten NB?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A01</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Beendigung der Zuordnung passt nicht zur Vereinbarung<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>2: </B>Ist der Absender zum Zuordnungsende an der Netzzeitreihe beteiligt?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A02</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Berechtigung für die Netzzeitreihe<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>3: </B>Ist der Empfänger zum Zuordnungsende an der Netzzeitreihe beteiligt?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A03</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Beteiligung an der Netzzeitreihe<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>4: </B>Existiert zum Zuordnungsende eine Zuordnung der angegebenen Netzgangzeitreihe<BR align="left"/>zu der angegebenen Netzzeitreihe?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A04</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zuordnung nicht vorhanden<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>5: </B>Ist ein nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A99</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Ablehnung Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.04.2024 00:00 Uhr<BR align="left"/></FONT>>];
    "A05" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A05</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Beendigung der Zuordnung durchgeführt<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A01" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "1" -> "2" [label=<<B>JA</B>>, color="#7aab8a"];
    "2" -> "A02" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "2" -> "3" [label=<<B>JA</B>>, color="#7aab8a"];
    "3" -> "A03" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "3" -> "4" [label=<<B>JA</B>>, color="#7aab8a"];
    "4" -> "A04" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "4" -> "5" [label=<<B>JA</B>>, color="#7aab8a"];
    "5" -> "A99" [label=<<B>JA</B>>, color="#7aab8a"];
    "5" -> "A05" [label=<<B>NEIN</B>>, color="#7aab8a"];

    bgcolor="transparent";
}
