FV2604/E_0103.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.2 | 11.12.2025 (urspr. 01.10.2025)
endfooter

title
MaBiS

7.9.1: AD: Beendigung der Zuordnung einer Netzgangzeitreihe zu einer Netzzeitreihe beim NB



end title
:<b>E_0103</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>1: </b> Entspricht die Beendigung der Zuordnung der Netzgangzeitreihe zur Netzzeitreihe der Vereinbarung zur messtechnischen Abgrenzung der beiden benachbarten NB?) then (ja)
else (nein)
    :A01;
    note left
        Cluster: Ablehnung
        Beendigung der Zuordnung passt nicht zur Vereinbarung
    endnote
    kill;
endif
if (<b>2: </b> Ist der Absender zum Zuordnungsende an der Netzzeitreihe beteiligt?) then (ja)
else (nein)
    :A02;
    note left
        Cluster: Ablehnung
        Keine Berechtigung für die Netzzeitreihe
    endnote
    kill;
endif
if (<b>3: </b> Ist der Empfänger zum Zuordnungsende an der Netzzeitreihe beteiligt?) then (ja)
else (nein)
    :A03;
    note left
        Cluster: Ablehnung
        Keine Beteiligung an der Netzzeitreihe
    endnote
    kill;
endif
if (<b>4: </b> Existiert zum Zuordnungsende eine Zuordnung der angegebenen Netzgangzeitreihe zu der angegebenen Netzzeitreihe?) then (ja)
else (nein)
    :A04;
    note left
        Cluster: Ablehnung
        Zuordnung nicht vorhanden
    endnote
    kill;
endif
if (<b>5: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.
        Nutzungsmöglichkeit Ende: 01.10.2026 00:00 Uhr
    endnote
    kill;
else (nein)
    :A05;
    note left
        Cluster: Zustimmung
        Beendigung der Zuordnung durchgeführt
    endnote
    kill;
endif

@enduml
